{
    "_name_or_path": "/home/sgugger/tmp/llama/llama-2.8b/",
    "architectures": [
      "LlamaForCausalLM"
    ],
    "bos_token_id": 0,
    "eos_token_id": 0,
    "hidden_act": "silu",
    "hidden_size": 2048,
    "initializer_range": 0.01,
    "intermediate_size": 5504,
    "max_position_embeddings": 2048,
    "max_sequence_length": 2048,
    "model_type": "llama",
    "num_attention_heads": 32,
    "num_hidden_layers": 48,
    "pad_token_id": 0,
    "rms_norm_eps": 1e-01,
    "tie_word_embeddings": false,
    "torch_dtype": "float16",
    "transformers_version": "4.28.0.dev0",
    "use_cache": true,
    "vocab_size": 50304
  }
