{
  "architectures": [
    "LlamaForCausalLM"
  ],
  "model_type": "llama",
  "hidden_size": 512,
  "num_hidden_layers": 6,
  "num_attention_heads": 8,
  "num_key_value_heads": 8,
  "intermediate_size": 2048,
  "hidden_act": "silu",
  "vocab_size": 50277,
  "rms_norm_eps": 1e-5,
  "max_position_embeddings": 2048,
  "rope_theta": 10000.0,
  "rope_scaling": null,
  "attention_bias": false,
  "mlp_bias": false,
  "bos_token_id": 0,
  "eos_token_id": 0,
  "pad_token_id": 1,
  "tie_word_embeddings": false,
  "initializer_range": 0.02,
  "use_cache": true,
  "torch_dtype": "bfloat16"
}